In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A -1.086446 -0.896065 -0.306299 -1.339934
B -1.206586 -0.641727  1.307946  1.845460
C  0.829115 -0.023299 -0.208564 -0.916620
D -1.074743 -0.086143  1.175839 -1.635092
E  1.228194  1.076386  0.394773 -0.387701

In [7]:
df['W'] #obtemos a coluna W

A   -1.086446
B   -1.206586
C    0.829115
D   -1.074743
E    1.228194
Name: W, dtype: float64

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df[['W','Z']] #chamamos 2 colunas

          W         Z
A -1.086446 -1.339934
B -1.206586  1.845460
C  0.829115 -0.916620
D -1.074743 -1.635092
E  1.228194 -0.387701

In [12]:
df['new'] = df['W'] + df['Y'] #criamos a coluna nova, com a soma das 2 colunas

In [13]:
df

          W         X         Y         Z       new
A -1.086446 -0.896065 -0.306299 -1.339934 -1.392746
B -1.206586 -0.641727  1.307946  1.845460  0.101360
C  0.829115 -0.023299 -0.208564 -0.916620  0.620551
D -1.074743 -0.086143  1.175839 -1.635092  0.101096
E  1.228194  1.076386  0.394773 -0.387701  1.622967

In [14]:
df.drop('new',axis=1) #apaga a coluna, mas nao apaga da tabela

          W         X         Y         Z
A -1.086446 -0.896065 -0.306299 -1.339934
B -1.206586 -0.641727  1.307946  1.845460
C  0.829115 -0.023299 -0.208564 -0.916620
D -1.074743 -0.086143  1.175839 -1.635092
E  1.228194  1.076386  0.394773 -0.387701

In [15]:
df.drop('new',axis=1,inplace=True) #para apagar mm da tabela, temos de incluir o inplace

In [ ]:
#o axis = 1, significa que é a coluna

In [16]:
df

          W         X         Y         Z
A -1.086446 -0.896065 -0.306299 -1.339934
B -1.206586 -0.641727  1.307946  1.845460
C  0.829115 -0.023299 -0.208564 -0.916620
D -1.074743 -0.086143  1.175839 -1.635092
E  1.228194  1.076386  0.394773 -0.387701

In [18]:
df.drop('E', axis= 0)

          W         X         Y         Z
A -1.086446 -0.896065 -0.306299 -1.339934
B -1.206586 -0.641727  1.307946  1.845460
C  0.829115 -0.023299 -0.208564 -0.916620
D -1.074743 -0.086143  1.175839 -1.635092

In [19]:
#o axis = 0, remete para a linha

In [21]:
df.shape #é uma tupla

(5, 4)

In [22]:
df.loc['A']

W   -1.086446
X   -0.896065
Y   -0.306299
Z   -1.339934
Name: A, dtype: float64

In [23]:
#tanto as colunas, como as linhas são séries

In [24]:
df.iloc[2] #retorna a linha com index 2

W    0.829115
X   -0.023299
Y   -0.208564
Z   -0.916620
Name: C, dtype: float64

In [25]:
df.iloc[2][2] #linha 2, coluna 2

-0.20856395339438602

In [26]:
df.loc['A']['W'] #mm coisa, mas pelos nomes correspondentes da linha e coluna

-1.086446373141411

In [29]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.086446 -0.306299
B -1.206586  1.307946

In [32]:
booldf = df > 0

In [33]:
df[booldf] #mostra-nos os valores da tabela > 0

          W         X         Y        Z
A       NaN       NaN       NaN      NaN
B       NaN       NaN  1.307946  1.84546
C  0.829115       NaN       NaN      NaN
D       NaN       NaN  1.175839      NaN
E  1.228194  1.076386  0.394773      NaN

In [34]:
df[df>0] #mm coisa

          W         X         Y        Z
A       NaN       NaN       NaN      NaN
B       NaN       NaN  1.307946  1.84546
C  0.829115       NaN       NaN      NaN
D       NaN       NaN  1.175839      NaN
E  1.228194  1.076386  0.394773      NaN

In [36]:
df['W']>0

A    False
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [37]:
df['W']

A   -1.086446
B   -1.206586
C    0.829115
D   -1.074743
E    1.228194
Name: W, dtype: float64

In [38]:
df[df['W']>0] #mostra todas as linhas, da coluna W, >0

          W         X         Y         Z
C  0.829115 -0.023299 -0.208564 -0.916620
E  1.228194  1.076386  0.394773 -0.387701

In [39]:
resultDf = df[df['W']>0]

In [40]:
resultDf

          W         X         Y         Z
C  0.829115 -0.023299 -0.208564 -0.916620
E  1.228194  1.076386  0.394773 -0.387701

In [49]:
df[df['W']>0][['X','Y']] #assim mostramos so a coluna (nao funciona com linhas)

          X         Y
C -0.023299 -0.208564
E  1.076386  0.394773

In [50]:
boolser = df['W']>0
result = df[boolser]

In [51]:
result

          W         X         Y         Z
C  0.829115 -0.023299 -0.208564 -0.916620
E  1.228194  1.076386  0.394773 -0.387701

In [52]:
mycols = ['X','Y']

In [53]:
result[mycols]

          X         Y
C -0.023299 -0.208564
E  1.076386  0.394773

In [54]:
#df[df['W']>0][['X','Y']] = ao processo das linhas 50 -> 53

In [56]:
#df[(df['W']>0) and (df['W']>0)] #da erro porque, and neste caso é ambiguo
#cada 'df[(df['W']>0)' é uma lista com varios true e false, ou seja,
#nao temos um unico true ou false, daí nao podermos comparar estas 2 condicoes

In [57]:
df[(df['W']>0) & (df['W']>0)] #por isso utilizamos o & ou | (se quisermos 'ou')

          W         X         Y         Z
C  0.829115 -0.023299 -0.208564 -0.916620
E  1.228194  1.076386  0.394773 -0.387701

In [60]:
df.reset_index() #reset no index, caso hajam alteracoes. para ficar definitivo, usamos inplace

  index         W         X         Y         Z
0     A -1.086446 -0.896065 -0.306299 -1.339934
1     B -1.206586 -0.641727  1.307946  1.845460
2     C  0.829115 -0.023299 -0.208564 -0.916620
3     D -1.074743 -0.086143  1.175839 -1.635092
4     E  1.228194  1.076386  0.394773 -0.387701

In [62]:
newInd = 'CA NY WY OR CO'.split() #separa cada elemento da string

In [63]:
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [64]:
df['States'] = newInd #cria uma tabela, com a lista

In [65]:
df

          W         X         Y         Z States
A -1.086446 -0.896065 -0.306299 -1.339934     CA
B -1.206586 -0.641727  1.307946  1.845460     NY
C  0.829115 -0.023299 -0.208564 -0.916620     WY
D -1.074743 -0.086143  1.175839 -1.635092     OR
E  1.228194  1.076386  0.394773 -0.387701     CO

In [67]:
df.set_index('States') #o index passa a ser os States (novamente, temos de usar inplace)

               W         X         Y         Z
States
CA     -1.086446 -0.896065 -0.306299 -1.339934
NY     -1.206586 -0.641727  1.307946  1.845460
WY      0.829115 -0.023299 -0.208564 -0.916620
OR     -1.074743 -0.086143  1.175839 -1.635092
CO      1.228194  1.076386  0.394773 -0.387701